app/controllers/speeches_controller.rb

  def index
    @speeches = Speech.all
---
SELECT `speeches`.* FROM `speeches`