app/models/dim_time.rb

  def self.buildDimension(id, form_type)
    if form_type == "quote"
      form = Quote.find(id)
    elsif form_type == "contact"
      form = Lead.find(id)
    end
    dimension = DimTime.new
    dimension.year = form.created_at.year
    dimension.month = form.created_at.month
    dimension.day = form.created_at.day
    dimension.form_type = form_type
    puts "Time dimension #{dimension.id} created successfully"
    dimension.save
---
SELECT  `leads`.* FROM `leads` WHERE `leads`.`id` = 1 LIMIT 1
INSERT INTO "dim_times" ("year", "month", "day", "form_type") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2022], ["month", 1], ["day", 10], ["form_type", "contact"]]