app/models/fact_quote.rb

SELECT `quotes`.* FROM `quotes` WHERE `quotes`.`created_at` BETWEEN '2022-01-09 20:07:47' AND '2022-01-10 21:07:47'
---
  def self.getQuotesData
    quotes = Quote.where({ created_at: (Time.now - 25.hour)..Time.now })
    quotes.each do |quote|