app/models/fact_contact.rb

SELECT `leads`.* FROM `leads` WHERE `leads`.`created_at` BETWEEN '2022-01-09 20:07:37' AND '2022-01-10 21:07:37'
INSERT INTO "fact_contacts" ("ContactId", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ContactId", 1], ["created_at", "2022-01-10 21:07:37.844080"], ["updated_at", "2022-01-10 21:07:37.844080"]]
SELECT  "fact_contacts".* FROM "fact_contacts" WHERE "fact_contacts"."ContactId" = $1 LIMIT $2  [["ContactId", 1], ["LIMIT", 1]]
UPDATE "fact_contacts" SET "Creation_Date" = $1, "Company_Name" = $2, "Email" = $3, "Project_Name" = $4, "updated_at" = $5, "dim_time_id" = $6 WHERE "fact_contacts"."id" = $7
---
  def self.getContactsData
    contacts = Lead.where({ created_at: (Time.now - 25.hour)..Time.now })

    contacts.each do |contact|
      fact = FactContact.find_or_create_by(ContactId: contact.id)
      fact.Creation_Date = contact.created_at
      fact.Company_Name = contact.company_name
      fact.Email = contact.email
      fact.Project_Name = contact.project_name
      if fact.dim_time_id == nil
        fact.dim_time_id = DimTime.buildDimension(fact.ContactId, "contact")
      end
      puts "Contact fact #{fact.id} created successfully"
      fact.save